shercliff/baseCase/basecase_epotFoam_gamg_weakScaling/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        symGaussSeidel;
        preconditioner  GAMG;
        tolerance       1e-06;
        relTol          0.05;
	maxIter		2000;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          GAMG;
        smoother        symGaussSeidel;
        preconditioner  GAMG;
        tolerance       1e-05;
        relTol          0;
	maxIter		2000;
    }

    PotE
    {
        solver          GAMG;
        smoother        symGaussSeidel;
        preconditioner  GAMG;
        tolerance       1e-05;
        relTol          0.05;
	maxIter		2000;
    }

}

PISO
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
}

PotE
{
    nCorrectors     0;
    nNonOrthogonalCorrectors 0;
    PotERefCell        0;
    PotERefValue       0;
}


// ************************************************************************* //
